graphite/app/controllers/show_controller.rb

SELECT * FROM `graphs` WHERE (`graphs`.tab_id = 34) ORDER BY sortorder ASC
SELECT * FROM `datasources` WHERE (`datasources`.`id` = 5098)
SELECT * FROM `graph_datasources` WHERE (`graph_datasources`.graph_id = 64) ORDER BY sortorder ASC
---
  def tab

    # Simple ACL - put into conf
    admins = ['barry.robison', 'adminbr', 'kim.pearce', 'adminkp', 'jay.munzner', 'adminjm', 'kenny.ferreira', 'stephen.tanamal', 'adminst', 'admindw', 'david.ward', 'surendra.perera', 'adminsp']

    # Selected tab
    tabId = params[:id] ? params[:id] : 2

    # Check for user cookie and user's tab
    @username = cookies[:username] || ''
    checkUserTab(@username.gsub!("\"", ""))

    # Get tabs
	@navigation = navigation(tabId)

    # Get Graphs
    @graphs = graphs(tabId)

    # Get total graphs count
    @graphCount = Graph.find(:all).length

    # Check ACL
    @access = admins.include?(@username) ? true : false

    # Get total datasources used in graphs
    @dsCount = GraphDatasource.find(:all).length

SELECT * FROM `graphs` WHERE (`graphs`.`id` = 64)
---
  def editGraph

    @graph = Graph.find(params[:id])

SELECT * FROM `datasources` WHERE (`datasources`.parent_id = 1) ORDER BY name
---
  def dsAvailable

    # Get the children of the selected node, or of the root node
    @datasources = Datasource.find(params[:id]||1).children

SELECT * FROM `graphs` WHERE (`graphs`.`id` = 64)
---
  def dsUsed

    id = (params[:type] == 'edit') ? params[:id] : nil

    # Get the selected graph
    if id
      @graph = Graph.find(id)